test/performance/benchmarks/real-traffic-test/results/preempt-k8s/10_seconds-20_interfering-no_monitoring/2026-02-24_08-13-06/vegeta_metrics.txt
=== Real Traffic Test Results ===


== Test Configuration ==

Services: 10
RPS: 50
Duration: 1m0s
Min Latency: 0s
Max Latency: 0s
Min Startup Latency: 0s
Max Startup Latency: 0s
Min Payload Size (bytes): 10000
Max Payload Size (bytes): 10000
Critical Test: true
Sources of Interference: 20
Interfering Namespace: interference
Bucket Node: dessertw3


== Test Results ==

= Aggregated Results =

Requests      [total, rate, throughput]         3000, 50.02, 50.01
Duration      [total, attack, wait]             59.985s, 59.98s, 5.141ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.766ms, 134.321ms, 6.342ms, 10.989ms, 916.261ms, 3.309s, 4.066s
Bytes In      [total, mean]                     29136797, 9712.27
Bytes Out     [total, mean]                     30000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:3000  
Error Set:

= Per-Service Results =

# Service: perftest-0
Criticality Level: 1

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.692ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.298ms, 120.211ms, 6.481ms, 11.659ms, 699.941ms, 3.078s, 3.573s
Bytes In      [total, mean]                     2913238, 9710.79
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-1
Criticality Level: 2

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.378ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.278ms, 154.905ms, 6.405ms, 10.814ms, 1.235s, 3.633s, 4.066s
Bytes In      [total, mean]                     2914516, 9715.05
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-2
Criticality Level: 3

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.8s, 5.795ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.077ms, 130.728ms, 6.391ms, 10.903ms, 859.135ms, 3.266s, 3.708s
Bytes In      [total, mean]                     2913070, 9710.23
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-3
Criticality Level: 4

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.572ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.892ms, 122.939ms, 6.161ms, 10.278ms, 759.089ms, 3.138s, 3.589s
Bytes In      [total, mean]                     2912348, 9707.83
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-4
Criticality Level: 5

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.808s, 59.801s, 7.248ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.864ms, 143.738ms, 6.114ms, 10.029ms, 1.025s, 3.408s, 3.865s
Bytes In      [total, mean]                     2913719, 9712.40
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-5
Criticality Level: 6

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.801s, 6.27ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.194ms, 144.008ms, 6.556ms, 11.088ms, 1.049s, 3.453s, 3.872s
Bytes In      [total, mean]                     2913245, 9710.82
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-6
Criticality Level: 7

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.807s, 59.8s, 6.611ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.852ms, 144.481ms, 6.16ms, 10.959ms, 1.075s, 3.443s, 3.896s
Bytes In      [total, mean]                     2913946, 9713.15
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-7
Criticality Level: 8

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.606ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.251ms, 122.723ms, 6.472ms, 12.823ms, 708.508ms, 3.158s, 3.561s
Bytes In      [total, mean]                     2914240, 9714.13
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-8
Criticality Level: 9

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.806s, 59.801s, 5.524ms
Latencies     [min, mean, 50, 90, 95, 99, max]  5.224ms, 132.684ms, 6.525ms, 11.307ms, 917.728ms, 3.282s, 3.728s
Bytes In      [total, mean]                     2914522, 9715.07
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set:

# Service: perftest-9
Criticality Level: 10

Requests      [total, rate, throughput]         300, 5.02, 5.02
Duration      [total, attack, wait]             59.805s, 59.8s, 5.141ms
Latencies     [min, mean, 50, 90, 95, 99, max]  4.766ms, 126.792ms, 6.256ms, 10.069ms, 801.108ms, 3.201s, 3.644s
Bytes In      [total, mean]                     2913953, 9713.18
Bytes Out     [total, mean]                     3000000, 10000.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:300  
Error Set: